3DdamBreak/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mesher pMesh;

surfaceFile "geometry/edges.stl";

minCellSize 0.030;
maxCellSize 4.000;

renameBoundary
{
    defaultName		obstacle;
    defaultType		wall;

    newPatchNames
    {
        "OpenSCAD_Model_1"
        {
            newName     atmosphere;
            type     patch;
        }
        "OpenSCAD_Model_(0|2|3|4|5)"
        {
            newName     walls;
            type     wall;
        }
    }
}
