3DdamBreak/system/probes.cfg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probes
{
    libs ( sampling );
    type        probes;
    name        probes;
    fields ( p );
    probeLocations
    (
        (0.831  -0.026  0.025)
        (0.831  -0.026  0.099)
        (0.806  0.026   0.165)
        (0.733  0.026   0.165)
    );
}
// ************************************************************************* //
